from typing import Dict


SCORE_LINE: Dict[str, Dict] = {
    "黑龙江": {"历史类": {"本科线": 405, "专科线": 160}, "物理类": {"本科线": 360, "专科线": 160}},
    "陕西":   {"历史类": {"本科线": 414, "专科线": 200}, "物理类": {"本科线": 394, "专科线": 200}},
    "重庆":   {"历史类": {"本科线": 438, "专科线": 180}, "物理类": {"本科线": 425, "专科线": 180}},
    "辽宁":   {"历史类": {"本科线": 437, "专科线": 150}, "物理类": {"本科线": 367, "专科线": 150}},
    "福建":   {"历史类": {"本科线": 450, "专科线": 235}, "物理类": {"本科线": 441, "专科线": 235}},
    "湖南":   {"历史类": {"本科线": 446, "专科线": 200}, "物理类": {"本科线": 405, "专科线": 200}},
    "河南":   {"历史类": {"本科线": 471, "专科线": 185}, "物理类": {"本科线": 427, "专科线": 185}},
    "河北":   {"历史类": {"本科线": 477, "专科线": 200}, "物理类": {"本科线": 459, "专科线": 200}},
    "江西":   {"历史类": {"本科线": 486, "专科线": 290}, "物理类": {"本科线": 429, "专科线": 240}},
    "江苏":   {"历史类": {"本科线": 482, "专科线": 220}, "物理类": {"本科线": 463, "专科线": 220}},
    "广西":   {"历史类": {"本科线": 402, "专科线": 200}, "物理类": {"本科线": 370, "专科线": 200}},
    "广东":   {"历史类": {"本科线": 464, "专科线": 215}, "物理类": {"本科线": 436, "专科线": 200}},
    "山西":   {"历史类": {"本科线": 443, "专科线": 100}, "物理类": {"本科线": 419, "专科线": 100}},
    "安徽":   {"历史类": {"本科线": 477, "专科线": 200}, "物理类": {"本科线": 461, "专科线": 200}},
    "宁夏":   {"历史类": {"本科线": 404, "专科线": 150}, "物理类": {"本科线": 372, "专科线": 150}},
    "四川":   {"历史类": {"本科线": 467, "专科线": 150}, "物理类": {"本科线": 438, "专科线": 150}},
    "内蒙古": {"历史类": {"本科线": 418, "专科线": 160}, "物理类": {"本科线": 375, "专科线": 160}},
    "云南":   {"历史类": {"本科线": 465, "专科线": 180}, "物理类": {"本科线": 430, "专科线": 180}},
    "青海":   {"历史类": {"本科线": 405, "专科线": 150}, "物理类": {"本科线": 350, "专科线": 150}},
    "贵州":   {"历史类": {"本科线": 458, "专科线": 180}, "物理类": {"本科线": 387, "专科线": 180}},
    "湖北":   {"历史类": {"本科线": 442, "专科线": 200}, "物理类": {"本科线": 426, "专科线": 200}},
    "吉林":   {"历史类": {"本科线": 384, "专科线": 160}, "物理类": {"本科线": 340, "专科线": 160}},
}

DESCRIPTION = {
    "北京": "379分以下由中位值拟合",
    "海南": "分数区间为[100, 900]",
    "上海": "402分以下数据未公开；\n满分660分",
}
